#ValetException
EXCEPTION000 = [{0}]: {1}
EXCEPTION001 = Se produjo una excepci\u00F3n:
EXCEPTION002 = C\u00D3DIGO_EXCEPCION: [{0}]; DESCRIPCI\u00D3N: [{1}]
EXCEPTION003 = C\u00D3DIGO_EXCEPCION: [{0}]; DESCRIPCI\u00D3N: [{1}]; CAUSA: {2}

#UtilsCertificate
UTILS_CERTIFICATE_000 = Error durante la creaci\u00F3n del certificado.
UTILS_CERTIFICATE_001 = Error obteniendo la clave p\u00FAblica del certificado. La clave p\u00FAblica es inv\u00E1lida.
UTILS_CERTIFICATE_002 = Error durante la creaci\u00F3n del certificado.
UTILS_CERTIFICATE_003 = Error realizando el hash del certificado.
UTILS_CERTIFICATE_004 = Error obteniendo el proveedor para el certificado dado.
UTILS_CERTIFICATE_005 = Error al tratar de obtener los prop\u00F3sitos de clave del certificado.
UTILS_CERTIFICATE_006 = Error los algoritmos de firma no coinciden.
#UtilsRFC2253
UTILS_RFC2253_000 = Car\u00E1cter inv\u00E1lido: {0}

#UtilsResources
UTILS_RESOURCES_000 = Se ha producido un error al tratar de cerrar el recurso de tipo [{0}].

#UtilsCrypto
UTILS_CRYPTO_000 = El algoritmo de hash [{0}] no est\u00E1 soportado.
UTILS_CRYPTO_001 = El algoritmo de hash no puede ser nulo, hay que especificarlo correctamente.
UTILS_CRYPTO_002 = Los datos sobre los que calcular el hash no pueden ser nulos o vac\u00EDos.

#UtilsCRL
UTILS_CRL_000 = No fu\u00E9 posible instanciar la factor\u00EDa de X.509 para construir la CRL.
UTILS_CRL_001 = Se ha producido un error construyendo X.509 CRL a partir de los datos de entrada.
UTILS_CRL_002 = No se puede hacer uso de la CRL para comprobar el estado del certificado, ya que no es indirecta y su emisor [{0}] no coincide con el del certificado [{1}].
UTILS_CRL_003 = No se puede hacer uso de la CRL para comprobar el estado del certificado, ya que no es indirecta y su emisor [{0}] no coincide con el del certificado [{1}] ni con ninguno de los confiables (aportados para esta CRL).
UTILS_CRL_004 = Se produjo un error tratando de analizar el contenido de la CRL.

#UtilsGrayLog
UTILS_GRAYLOG_000 = EVENT_CODE=[{0}];RESOURCE_INFO=[{1}];MESSAGE=[{2}];
UTILS_GRAYLOG_001 = No se pudo inicializar la herramienta de env\u00EDo de mensajes a Gray Log.
UTILS_GRAYLOG_002 = El uso de GrayLog se encuentra deshabilitado en la configuraci\u00F3n.
UTILS_GRAYLOG_003 = El c\u00F3digo de evento y/o el mensaje a escribir en GrayLog, no tienen valores correctos: EVENT_CODE=[{0}] MESSAGE=[{1}].
UTILS_GRAYLOG_004 = El uso de GrayLog ha sido deshabilitado debido a que hubo problemas en la inicializaci\u00F3n de la configuraci\u00F3n.
UTILS_GRAYLOG_005 = La configuraci\u00F3n de acceso y uso de GrayLog se ha inicializado correctamente y se encuentra habilitada.
UTILS_GRAYLOG_006 = La configuraci\u00F3n de GrayLog est\u00E1 establecida a deshabilitado.
UTILS_GRAYLOG_007 = No se ha podido obtener el nombre de host para informar en los mensajes de GrayLog.
UTILS_GRAYLOG_008 = Ha habido problemas con la configuraci\u00F3n de GrayLog y no se ha podido enviar el mensaje.

#UtilsLDAP
UTILS_LDAP_000 = Se produjo un error al tratar de realizar una conexi\u00F3n LDAP [{0}] (si el puerto no se especifica en la URL, se usa por defecto [{1}]).
UTILS_LDAP_001 = Se produjo un error al tratar de realizar una conexi\u00F3n LDAP [{0}] (si el puerto no se especifica en la URL, se usa por defecto [{1}]) haciendo uso del usuario [{2}] y password [XXXXXXX].
UTILS_LDAP_002 = Se ha encontrado la ruta dentro del LDAP, pero no contiene el atributo [certificateRevocationList], por lo que no se ha recuperado ninguna CRL.
UTILS_LDAP_003 = Se ha encontrado la ruta dentro del LDAP, y esta contiene el atributo [certificateRevocationList].
UTILS_LDAP_004 = No existe ninguna CRL en la ruta indicada dentro del LDAP.
UTILS_LDAP_005 = Se ha producido un error tratando de explorar la ruta dentro del LDAP.

#UtilsConnection
UTILS_CONNECTION_000 = La propiedad [{0}] no contiene un valor adecuado. Se tomar\u00E1 su valor por defecto: [{1}].
UTILS_CONNECTION_001 = La propiedad [{0}] no tiene un valor asignado. Se tomar\u00E1 su valor por defecto: [{1}].

#ValetSSLSocketFactory
UTILS_SSL_SOCKET_000 = No se han obtenido los algoritmos de cifrado que deben ser restringidos en la comunicaci\u00F3n SSL.
UTILS_SSL_SOCKET_001 = No se han obtenido los protocolos que deben ser restringidos en la comunicaci\u00F3n SSL.

#UtilsProviders
UTILS_PROVIDERS_000 = No se ha encontrado ning\u00FAn proveedor criptogr\u00E1fico declarado en la JDK que disponga del algoritmo de generaci\u00F3n de n\u00FAmeros aleatorios [{0}].
UTILS_PROVIDERS_001 = No se ha encontrado el algoritmo de generaci\u00F3n de n\u00FAmeros aleatorios [{0}] para el proveedor [{1}]. Se procede a intentar obtener este mismo algoritmo para cualquier otro proveedor declarado en la JDK.
UTILS_PROVIDERS_002 = No se ha encontrado el proveedor criptogr\u00E1fico [{0}]. Se intentar\u00E1 obtener el algoritmo de generaci\u00F3n de numeros aleatorios [{1}] para cualquier otro proveedor declarado en la JDK.
UTILS_PROVIDERS_003 = Se ha obtenido un generador de n\u00FAmeros aleatorios para el algoritmo [{0}] y proveedor [{1}].
UTILS_PROVIDERS_004 = Se va a usar un generador de n\u00FAmeros aleatorios para el algoritmo [{0}] y proveedor [{1}].
