# es.gob.valet.cache.impl
CACHE_IMPL_001 = Error al a\u00F1adir el objeto en la Cach\u00E9: {0}
CACHE_IMPL_002 = Objeto a\u00F1adido correctamente al Cach\u00E9 en el path: {0}
CACHE_IMPL_003 = El path de acceso a la Cach\u00E9 no puede ser nulo.
CACHE_IMPL_004 = El path de acceso a la Cach\u00E9 debe comenzar con el s\u00EDmbolo del ra\u00EDz: {0}
CACHE_IMPL_005 = El array que representa al path de acceso en la Cach\u00E9 debe tener al menos un componente.
CACHE_IMPL_006 = Uno de los componentes del path de acceso en la Cach\u00E9 es nulo o una cadena vac\u00EDa.
CACHE_IMPL_007 = Error al recuperar el objeto de la Cach\u00E9: {0}
CACHE_IMPL_008 = No existe ning\u00FAn objeto almacenado en la Cach\u00E9 en el path: {0}
CACHE_IMPL_009 = Objeto recuperado correctamente de la Cach\u00E9 del path: {0}
CACHE_IMPL_010 = Error al eliminar el objeto de la Cach\u00E9: {0}
CACHE_IMPL_011 = Objeto eliminado correctamente de la Cach\u00E9 del path: {0}
CACHE_IMPL_012 = Error al eliminar el nodo de la Cach\u00E9: {0}
CACHE_IMPL_013 = Nodo eliminado correctamente de la Cach\u00E9 del path: {0}
CACHE_IMPL_014 = Se procede a esperar un tiempo de {0} segundos antes de detener la cach\u00E9 auxiliar...
CACHE_IMPL_015 = Se ha interrumpido el tiempo de espera para detener la cach\u00E9 auxiliar.
CACHE_IMPL_016 = Se procede a detener la cach\u00E9 con nombre [{0}].
CACHE_IMPL_017 = Recarga Cach\u00E9 Local: La anterior cach\u00E9 local [{0}] ha sido limpiada y detenida.

# es.gob.valet.cache.impl.javaConcurrentMap
CACHE_IMPL_JCM_001 = Creando Cache mediante Java Concurrent Map...
CACHE_IMPL_JCM_002 = Creaci\u00F3n de la Cache mediante Java Concurrent Map finalizada correctamente.
CACHE_IMPL_JCM_003 = Error durante la creaci\u00F3n de la cach\u00E9 mediante Java Concurrent Map.
CACHE_IMPL_JCM_004 = Deteniendo el servicio de la cach\u00E9 mediante Java Concurrent Map...
CACHE_IMPL_JCM_005 = No se puede detener el servicio de Cach\u00E9 mediante Java Concurrent Map porque a\u00FAn no est\u00E1 creado.
CACHE_IMPL_JCM_006 = Cach\u00E9 Java Concurrent Map detenida.
CACHE_IMPL_JCM_007 = Se inicia una nueva cach\u00E9 mediante Java Concurrent Map con identificador [{0}];
