# es.gob.valet.alarms
ALARM_MNG_000 = Se produjo un error durante el env\u00EDo del correo de notificaci\u00F3n de evento de alarma.
ALARM_MNG_001 = El evento de alarma [{0}] no se registrar\u00E1 debido a que se encuentra deshabilitada.
ALARM_MNG_002 = No se puede registrar una alarma si no se ha especificado correctamente su identificador.
ALARM_MNG_003 = No se puede registrar la alarma con identificador [{0}] debido a que no se ha especificado un mensaje para esta.
ALARM_MNG_004 = No se puede enviar el e-mail de notificaci\u00F3n de alarma [{0}] debido a que no tiene destinatarios asignados.
ALARM_MNG_005 = La alarma [{0}] pasa a estar bloqueada en la instancia [{1}] por un periodo de tiempo de [{2}] milisegundos.
ALARM_MNG_006 = Se produjo un error no controlado durante el env\u00EDo del correo de notificaci\u00F3n de la alarma [{0}].
ALARM_MNG_007 = Se produjo un error durante la generaci\u00F3n del correo que acumular\u00EDa los eventos mientras estuviera la alarma [{0}] bloqueada, por lo que NO se ha bloqueado.
ALARM_MNG_008 = No se reconoce la operaci\u00F3n solicitada para la gesti\u00F3n de alarmas.
ALARM_MNG_009 = No se puede enviar el e-mail de notificaci\u00F3n de la alarma [{0}] debido a que no tiene destinatarios asignados.
ALARM_MNG_010 = Se produjo un error intentando mandar el mensaje de notificaci\u00F3n y bloqueo de la alarma [{0}].
ALARM_MNG_011 = {0} - {1} - RESUMEN DE EVENTOS DURANTE EL BLOQUEO - {2}
ALARM_MNG_012 = Contrucci\u00F3n del resumen de eventos de alarma. La alarma permanecer\u00E1 bloqueada durante [{0}] milisegundos.
ALARM_MNG_013 = Se produjo un error no controlado durante la creaci\u00F3n del correo que acumular\u00EDa los eventos de la alarma [{0}] mientras estuviera bloqueada.
ALARM_MNG_014 = Fin de bloqueo de la alarma.
ALARM_MNG_015 = No se puede desbloquear la alarma [{0}] ya que no se encontrada bloqueada.
ALARM_MNG_016 = {0} - {1} - {2}
ALARM_MNG_017 = Se produjo un error grave en la creaci\u00F3n de la tarea que recopila los eventos de la alarma [{0}] mientras est\u00E1 bloqueada.

ALM001_EVENT_000 = No se ha podido comprobar el estado de revocaci\u00F3n del certificado reconocido en la TSL [{0}], TSP [{1}] y TSP-Service [{2}]{3}.
ALM002_EVENT_000 = Se ha producido un error tratando de obtener la TSL [{0}] de [{1}].
ALM002_EVENT_001 = Durante el proceso de comprobaci\u00F3n de nuevas versiones de TSL se ha producido un error parseando la TSL [{0}] obtenida de [{1}].
ALM002_EVENT_002 = No se puede comprobar si existe una nueva versi\u00F3n de la TSL [{0}] al no conocer la URL de descarga (distributionPoints).
ALM002_EVENT_003 = Durante el proceso de comprobaci\u00F3n de nuevas versiones de TSL, analizando la TSL [{0}] de [{1}], se produjo un error inesperado.
ALM003_EVENT_000 = Se ha producido un error obteniendo/parseando una CRL de [{0}].
ALM003_EVENT_001 = No se conf\u00EDa en el emisor de CRL [{0}].
ALM004_EVENT_000 = Se ha producido un error obteniendo/parseando la respuesta OCSP de [{0}].
ALM004_EVENT_001 = No se conf\u00EDa en el responder de la respuesta OCSP. Dicho responder es [{0}] emitido por [{1}].
ALM005_EVENT_000 = Durante el proceso de comprobaci\u00F3n de nuevas versiones de TSL se ha detectado para la TSL [{0}] obtenida de [{1}] una nueva versi\u00F3n [{2}]. Actualmente se dispone de la versi\u00F3n [{3}].
ALM005_EVENT_001 = Durante el proceso de comprobaci\u00F3n de nuevas versiones de TSL se ha detectado para la TSL [{0}] obtenida de [{1}] una nueva versi\u00F3n [{2}]. Actualmente se dispone de la versi\u00F3n [{3}], pero se produjo un error actualizando los datos de comprobaci\u00F3n de nueva versi\u00F3n en base de datos.
ALM005_EVENT_002 = Existe una nueva versi\u00F3n para la TSL [{0}]-[{1}]. Esto es un recordatorio ya que fue notificada hace m\u00E1s de siete d\u00EDas.

# es.gob.valet.audit
CCAT_000 = Se produjo un error obteniendo los datos de la evidencia de revocaci\u00F3n, por lo que no se incluir\u00E1 esta informaci\u00F3n en la traza de auditor\u00EDa.
CSAT_000 = No se ha especificado correctamente el identificador de transacci\u00F3n, por lo que no se escribir\u00E1 en auditor\u00EDa.
CSAT_001 = Se ha producido un error calculando el hash de la respuesta, por lo que no se escribir\u00E1 el evento de cierre de transacci\u00F3n.
CSAT_002 = Se ha producido un error con el identificador de transacci\u00F3n, por lo que no se escribir\u00E1 el evento de cierre de transacci\u00F3n.

# es.gob.valet.crypto.keystore
KEYSTORE_FACTORY_001 = El ID del almac\u00E9n de certificados no puede ser nulo.
KEYSTORE_FACTORY_002 = No ha sido posible rescatar de la cach\u00E9 la informaci\u00F3n asociada al almac\u00E9n de claves con ID [{0}].
STANDARD_KEYSTORE_001 = Inicio: Importar certificado con alias [{0}] en el almac\u00E9n de certificados [{1}].
STANDARD_KEYSTORE_002 = Fin: Importar certificado con alias [{0}] en el almac\u00E9n de certificados [{1}].
STANDARD_KEYSTORE_003 = El certificado no puede ser nulo.
STANDARD_KEYSTORE_004 = El alias no puede ser nulo.
STANDARD_KEYSTORE_005 = 
STANDARD_KEYSTORE_006 = 
STANDARD_KEYSTORE_007 = 
STANDARD_KEYSTORE_008 = 
STANDARD_KEYSTORE_009 = Se ha producido un error al tratar de importar la entrada con alias [{0}] en el almac\u00E9n de claves [{1}].
STANDARD_KEYSTORE_010 = Inicio: Actualizar el alias [{0}] por [{1}] en el almac\u00E9n de claves [{2}].
STANDARD_KEYSTORE_011 = Fin: Actualizar el alias [{0}] por [{1}] en el almac\u00E9n de claves [{2}].
STANDARD_KEYSTORE_012 = El alias a modificar no puede ser nulo.
STANDARD_KEYSTORE_013 = El nuevo alias a asignar no puede ser nulo.
STANDARD_KEYSTORE_014 = Se ha producido un error al tratar de descifrar la clave del almac\u00E9n [{0}].
STANDARD_KEYSTORE_015 = 
STANDARD_KEYSTORE_016 = Se ha producido un error al tratar de modificar el alias [{0}] por el nuevo alias [{1}] en el almac\u00E9n de claves [{2}].
STANDARD_KEYSTORE_017 = Inicio: Obtener certificado con alias [{0}] del almac\u00E9n de certificados [{1}].
STANDARD_KEYSTORE_018 = Fin: Obtener certificado con alias [{0}] del almac\u00E9n de certificados [{1}].
STANDARD_KEYSTORE_019 = 
STANDARD_KEYSTORE_020 = Se ha producido un error al tratar de recuperar el certificado con alias [{0}] del almac\u00E9n de claves [{1}].
STANDARD_KEYSTORE_021 = Inicio: Obtener clave privada con alias [{0}] del almac\u00E9n de certificados [{1}].
STANDARD_KEYSTORE_022 = Fin: Obtener clave privada con alias [{0}] del almac\u00E9n de certificados [{1}].
STANDARD_KEYSTORE_023 = 
STANDARD_KEYSTORE_024 = Se ha producido un error al tratar de recuperar la clave privada con alias [{0}] del almac\u00E9n de claves [{1}].
STANDARD_KEYSTORE_025 = Inicio: Modificar contrase\u00F1a del almac\u00E9n de certificados [{0}].
STANDARD_KEYSTORE_026 = Fin: Modificar contrase\u00F1a del almac\u00E9n de certificados [{0}].
STANDARD_KEYSTORE_027 = La contrase\u00F1a a establecer no puede ser nula.
STANDARD_KEYSTORE_028 = 
STANDARD_KEYSTORE_029 = Se ha producido un error al tratar de modificar la contrase\u00F1a del almac\u00E9n de certificados [{0}].
STANDARD_KEYSTORE_030 = 
STANDARD_KEYSTORE_031 = Inicio: Obtener todos los alias de los certificados del almac\u00E9n de certificados [{0}].
STANDARD_KEYSTORE_032 = Fin: Obtener todos los alias de los certificados del almac\u00E9n de certificados [{0}].
STANDARD_KEYSTORE_033 = 
STANDARD_KEYSTORE_034 = Se ha producido un error al tratar de recuperar una lista con todos los alias de los certificados almacenados en el almac\u00E9n de certificados [{0}].
STANDARD_KEYSTORE_035 = 
STANDARD_KEYSTORE_036 = 
STANDARD_KEYSTORE_037 = 
STANDARD_KEYSTORE_038 = 
STANDARD_KEYSTORE_039 = 
STANDARD_KEYSTORE_040 = 
STANDARD_KEYSTORE_041 = 
STANDARD_KEYSTORE_042 = 
STANDARD_KEYSTORE_043 = 
STANDARD_KEYSTORE_044 = 
STANDARD_KEYSTORE_045 = 
STANDARD_KEYSTORE_046 = 
STANDARD_KEYSTORE_047 = 
STANDARD_KEYSTORE_048 = 
STANDARD_KEYSTORE_049 = 
STANDARD_KEYSTORE_050 = 
STANDARD_KEYSTORE_051 = 
STANDARD_KEYSTORE_052 = 
STANDARD_KEYSTORE_053 = 
STANDARD_KEYSTORE_054 = 
STANDARD_KEYSTORE_055 = Inicio: Eliminar una lista de Entradas del almac\u00E9n de certificados [{0}].
STANDARD_KEYSTORE_056 = Fin: Eliminar una lista de Entradas del almac\u00E9n de certificados [{0}].
STANDARD_KEYSTORE_057 = La lista de alias no puede ser nula ni vac\u00EDa.
STANDARD_KEYSTORE_058 = Se va a eliminar la entrada con alias [{0}] del almac\u00E9n de certificados [{1}].
STANDARD_KEYSTORE_059 = Se produjo un error eliminando un listado de entradas del almac\u00E9n de certificados [{0}].
STANDARD_KEYSTORE_060 = Inicio: Obtener todos los certificados del almac\u00E9n de claves [{1}].
STANDARD_KEYSTORE_061 = Fin: Obtener todos los certificados del almac\u00E9n de claves [{1}].
STANDARD_KEYSTORE_062 = 
STANDARD_KEYSTORE_063 = Se ha producido un error al tratar de recuperar todos los certificados del almac\u00E9n de claves [{0}].
STANDARD_KEYSTORE_064 = 
STANDARD_KEYSTORE_065 = 
STANDARD_KEYSTORE_066 = 
STANDARD_KEYSTORE_067 = 
STANDARD_KEYSTORE_068 = 
STANDARD_KEYSTORE_069 = 
STANDARD_KEYSTORE_070 = Inicio: Eliminaci\u00F3n de la entrada con alias [{0}] del almac\u00E9n de certificados [{1}].
STANDARD_KEYSTORE_071 = Fin: Eliminaci\u00F3n de la entrada con alias [{0}] del almac\u00E9n de certificados [{1}].
STANDARD_KEYSTORE_072 = Se produjo un error eliminando la entrada con alias [{0}] del almac\u00E9n de certificados [{1}].
STANDARD_KEYSTORE_073 = No se puede actualizar el alias [{0}] por [{1}] en el almac\u00E9n de certificados [{2}] porque este ya se encuentra definido.

# es.gob.valet.tasks
TASK_MNG_000 = Se inicia la carga de las tareas establecidas en la administraci\u00F3n.
TASK_MNG_001 = Se han detectado un total de {0} tareas a cargar. 
TASK_MNG_002 = Tarea -> [{0}]; Clase -> [{1}];
TASK_MNG_003 = Se produjo un error a\u00F1adiendo un planificador a la tarea [{0}].
TASK_MNG_004 = No se encuentra la clase [{0}] que implementa la tarea [{1}], por lo que no se puede cargar.
TASK_MNG_005 = 
TASK_MNG_006 = 
TASK_MNG_007 = 
TASK_MNG_008 = 
TASK_MNG_009 = 
HIDDEN_TASK_MNG_000 = No se puede inicializar la tarea oculta/est\u00E1tica [{0}] debido a que no se encuentran todas sus propiedades definidas.
HIDDEN_TASK_MNG_001 = La tarea oculta [{0}] no dispone de la propiedad [{1}] correctamente definida. 
HIDDEN_TASK_MNG_002 = La tarea oculta [{0}], en su propiedad [{1}], no cumple el formato [{2}].
HIDDEN_TASK_MNG_003 = Se produjo un error eliminando la tarea [{0}] del programador correspondiente.
HIDDEN_TASK_MNG_004 = Se produjo un error actualizando la tarea [{0}] en el programador correspondiente.
HIDDEN_TASK_MNG_005 = Se produjo un error a\u00F1adiendo la tarea [{0}] en el programador correspondiente.
HIDDEN_TASK_MNG_006 = La tarea [{0}] no se inicializar\u00E1 debido a que no corresponde con este tipo de despliegue.

# es.gob.valet.utils
UTILS_CACHE_000 = Se ha producido un error durante la recarga de la cach\u00E9 de configuraci\u00F3n.
#UTILS_CACHE_001 = Se ha producido un error mientras se esperaba un tiempo antes de solicitar la recarga de la cach\u00E9 en otro nodo del cluster.
#UTILS_CACHE_002 = Se ha producido un error al tratar de consultar a los nodos del cluster si actualmente est\u00E1n recargando su cach\u00E9 local de configuraci\u00F3n.
#UTILS_CACHE_003 = Se produjo un error consultando cu\u00E1les nodos del cluster est\u00E1n recargando su cach\u00E9 local. Se esperar\u00E1n {0} milisegundos para volver a intentarlo. 
#UTILS_CACHE_004 = Se produjo un error esperando a que los nodos del cluster terminaran de recargar su cach\u00E9 local de configuraci\u00F3n.
UTILS_CACHE_005 = Recarga Cach\u00E9 Local: Se inicia el proceso de recarga de la cach\u00E9 local.
#UTILS_CACHE_006 = Recarga Cach\u00E9 Local: Se procede a limpiar la cach\u00E9 de Hibernate.
#UTILS_CACHE_007 = Recarga Cach\u00E9 Local: Se procede a cargar todos los keystores.
UTILS_CACHE_008 = Recarga Cach\u00E9 Local: Se procede a recargar la configuraci\u00F3n del proxy.
#UTILS_CACHE_009 = Recarga Cach\u00E9 Local: Se procede a recargar la lista de certificados de confianza para las respuestas OCSP.
UTILS_CACHE_010 = Recarga Cach\u00E9 Local: Se procede a recargar las TSL.
UTILS_CACHE_011 = Recarga Cach\u00E9 Local: El proceso de recarga de la cach\u00E9 de configuraci\u00F3n ha finalizado.
#UTILS_CACHE_012 = Recarga Cach\u00E9 En Cluster: Se inicia el proceso de recarga de cach\u00E9 en todos los nodos del cluster.
#UTILS_CACHE_013 = Recarga Cach\u00E9 En Cluster: Se procede a consultar a todos los nodos del cluster si hay alguno actualmente recargando la cach\u00E9, en cuyo caso se espera a su finalizaci\u00F3n.
#UTILS_CACHE_014 = Recarga Cach\u00E9 En Cluster: Se solicita al nodo [{0}] que ejecute la recarga de su cach\u00E9 local.
#UTILS_CACHE_015 = Recarga Cach\u00E9 En Cluster: Se procede a consultar a todos los nodos del cluster si a\u00FAn hay alguno actualmente recargando la cach\u00E9, en cuyo caso se espera a su finalizaci\u00F3n.
#UTILS_CACHE_016 = Recarga Cach\u00E9 En Cluster: El proceso de recarga de cach\u00E9 en todos los nodos del cluster ha finalizado.
#UTILS_CACHE_017 = Recarga Cach\u00E9 En Cluster: Debido a que los nodos [{0}] a\u00FAn no han finalizado su recarga de cach\u00E9, se espera un timeout de [{1} milisegundos] para volver a consultar.
UTILS_CACHE_018 = El tiempo empleado en la operaci\u00F3n de recarga de la cach\u00E9 de configuraci\u00F3n ha sido de [{0} (horas:minutos:segundos)];
#UTILS_CACHE_019 = Recarga Cach\u00E9 Local: Se proceden a limpiar y recargar todos los pool de conexiones para las diferentes TSAs.
#UTILS_CACHE_020 = El tiempo empleado en la operativa de cargar los almacenes de claves en la cach\u00E9 ha sido de [{0} milisegundos].
UTILS_CACHE_021 = El tiempo empleado en la operativa de cargar la configuraci\u00F3n del proxy en la cach\u00E9 ha sido de [{0} milisegundos].
#UTILS_CACHE_022 = El tiempo empleado en la operativa de cargar los certificados de confianza OCSP en la cach\u00E9 ha sido de [{0} milisegundos].
UTILS_CACHE_023 = El tiempo empleado en la operativa de cargar las TSL en la cach\u00E9 ha sido de [{0} milisegundos].
#UTILS_CACHE_024 = Se produjo un error consultando si este nodo est\u00E1 recargando su cach\u00E9 local. Se esperar\u00E1n {0} milisegundos para volver a intentarlo. 
#UTILS_CACHE_025 = Se produjo un error esperando a que este nodo terminara de recargar su cach\u00E9 local de configuraci\u00F3n.
#UTILS_CACHE_026 = Se produjo un error consultando si este nodo est\u00E1 recargando su cach\u00E9 local.
UTILS_HTTP_000 = La conexi\u00F3n se ha establecido.
UTILS_HTTP_001 = Se ha excedido el tama\u00F1o m\u00E1ximo permitido de la longitud de los datos a descargar [{0} bytes].
UTILS_HTTP_002 = La longitud de los datos [{0} bytes] excede del tama\u00F1o m\u00E1ximo permitido [{1} bytes].
UTILS_HTTP_003 = La cantidad de bytes le\u00EDdos no coincide con la cantidad de bytes que ocupa el recurso al que se trata de acceder.
UTILS_HTTP_004 = Informaci\u00F3n extraida correctamente de la respuesta http/s.
UTILS_HTTP_005 = Se ha producido un error en la conexi\u00F3n HTTP/S. StatusCode: [{0}]; ReasonPhrase: [{1}];
UTILS_HTTP_006 = Se ha producido un error en la conexi\u00F3n HTTP/S. Ni siquiera se ha obtenido respuesta.
UTILS_HTTP_007 = No se ha conseguido obtener los datos de [{0}].
UTILS_HTTP_008 = Los datos de entrada para la conexi\u00F3n HTTP/S mediante POST no pueden ser nulos.
UTILS_HTTP_009 = Enviando petici\u00F3n HTTP/S a la ruta [{0}].
UTILS_HTTP_010 = Recibida respuesta del servidor.
UTILS_HTTP_011 = Leyendo informacion desde el origen...
UTILS_HTTP_012 = El Content-Type de la respuesta no es [{0}], sino que se ha recibido Content-type: [{1}].
UTILS_HTTP_013 = Se ha producido un error al cerrar los recursos usados para la conexi\u00F3n.
UTILS_HTTP_014 = No se pudieron obtener los datos de respuesta de [{0}].
UTILS_PROXY_000 = Se ha producido un error al cargar el host y puerto a usar para el proxy (Host=[{0}], Port=[{1}]), por lo que no se usar\u00E1 proxy para las conexiones.
UTILS_PROXY_001 = Se ha producido un error al cargar el host y puerto a usar para el proxy seguro (Host=[{0}], Port=[{1}]), por lo que no se usar\u00E1 proxy seguro para las conexiones.
UTILS_PROXY_002 = Se ha producido un error al cargar el usuario y password para la autenticaci\u00F3n en el proxy (User=[{0}], Password=[{1}]), por lo que no se usar\u00E1 autenticaci\u00F3n para el proxy.
UTILS_PROXY_003 = Se ha producido un error al cargar el usuario y password para la autenticaci\u00F3n en el proxy seguro (User=[{0}], Password=[{1}]), por lo que no se usar\u00E1 autenticaci\u00F3n para el proxy seguro.
UTILS_PROXY_004 = Se ha producido un error al cargar el domain y workstation para la autenticaci\u00F3n NTLM en el proxy (Domain=[{0}], WorkStation=[{1}]), por lo que se usar\u00E1 autenticaci\u00F3n b\u00E1sica para el proxy (no NTLM).
UTILS_PROXY_005 = Se ha producido un error al cargar el domain y workstation para la autenticaci\u00F3n NTLM en el proxy seguro (Domain=[{0}], WorkStation=[{1}]), por lo se usar\u00E1 autenticaci\u00F3n b\u00E1sica para el proxy seguro (no NTLM).
UTILS_PROXY_006 = Se ha cargado correctamente la configuraci\u00F3n del proxy.
UTILS_PROXY_007 = No se ha podido determinar si se trata de una ruta local por lo que se considera que no lo es. Se ha tratado de comprobar la ruta: [{0}].
UTILS_PROXY_008 = No se pudo comprobar si la URL [{0}] es una de las asignadas para las que NO se usar\u00E1 el proxy, por lo que por defecto se permite el uso del proxy para dicha URL.

# es.gob.valet.utils.threads
EMAIL_000 = No se ha establecido correctamente la direcci\u00F3n de correo a usar como emisor. En su defecto se usar\u00E1 [valet\0040valet.es].
EMAIL_001 = El host destino para el servidor de correo no puede se nulo ni vac\u00EDo.
EMAIL_002 = No se ha especificado correctamente el puerto a usar para el servidor de correo. Por defecto se usar\u00E1 el 25.
EMAIL_003 = No se ha especificado correctamente el password para hacer uso de autenticaci\u00F3n para el servidor de correo. En consecuencia no se har\u00E1 uso de la autenticaci\u00F3n.
EMAIL_004 = Para hacer uso de la autenticaci\u00F3n con el servidor de correo es requisito que ni el usuario ni el password a usar sean nulos. Se deshabilita la autenticaci\u00F3n.
EMAIL_005 = Error creando el correo electr\u00F3nico: No se ha indicado ning\u00FAn destinatario.
EMAIL_006 = Error creando el correo electr\u00F3nico: No se ha indicado el asunto.
EMAIL_007 = Error creando el correo electr\u00F3nico: No se ha indicado el cuerpo del mensaje.
EMAIL_008 = El destinatario [{0}] no es v\u00E1lido, por lo que se ignorar\u00E1 para el env\u00EDo del correo.
EMAIL_009 = Error enviando el correo electr\u00F3nico.
EMAIL_010 = \    ** Invalid Email
EMAIL_011 = \    ** ValidUnsent Email
EMAIL_012 = \    ** ValidSent Email
EMAIL_013 = \         {0}
EMAIL_014 = Bad Stack2string
EMAIL_015 = No se ha encontrado la informaci\u00F3n relativa al servidor de correo en base de datos.

# es.gob.valet.spring.config
INITIALIZATION_000 = Inicializando la configuraci\u00F3n y datos de la plataforma...
INITIALIZATION_001 = La plataforma se ha inicializado correctamente.
INITIALIZATION_002 = Se produjeron errores durante la inicializaci\u00F3n de la configuraci\u00F3n y datos de la plataforma.
INITIALIZATION_003 = No se ha inicializado correctamente la cach\u00E9.
INITIALIZATION_004 = El tiempo empleado en la operativa de cargar las TSL en la cach\u00E9 ha sido de [{0} milisegundos].
INITIALIZATION_005 = La carga completa de la cach\u00E9 se ha realizado en [{0} milisegundos].
INITIALIZATION_006 = El tiempo empleado en la operativa de cargar la configuraci\u00F3n del proxy en la cach\u00E9 ha sido de [{0} milisegundos].
INITIALIZATION_007 = Se ha inicializado la plataforma valET correspondiente a la instancia [{0}]. La carga de la cach\u00E9 se ha realizado en [{1} milisegundos].
INITIALIZATION_008 = La carga de certificados emisores en cach\u00E9 se ha realizado en [{0} milisegundos].

#es.gob.valet.certificates
CC_000 = Se produjo un error obteniendo los certificados almacenados en el keystore CA. [{0}]