# Textos de la gesti\u00F3n de la cach\u00E9 de la configuraci\u00F3n de la plataforma.
CONFCACHE000 = No se ha podido acceder al cach\u00E9 de la configuraci\u00F3n de la plataforma.
CONFCACHE001 = No se puede almacenar un objeto nulo en la cach\u00E9 de configuraci\u00F3n.
CONFCACHE002 = La ruta donde almacenar un objeto en la cach\u00E9 de configuraci\u00F3n no puede ser nula.
CONFCACHE003 = Se ha a\u00F1adido correctamente en la cach\u00E9 de configuraci\u00F3n el objeto [{0}].
CONFCACHE004 = La ruta de donde extraer el objeto de configuraci\u00F3n de la cach\u00E9 de configuraci\u00F3n no puede ser nula.
CONFCACHE005 = La ruta que se desea eliminar de la cach\u00E9 de configuraci\u00F3n no puede ser nula.
CONFCACHE006 = Se procede a a\u00F1adir en la cach\u00E9 de configuraci\u00F3n el objeto [{0}].
CONFCACHE007 = Se ha eliminado correctamente de la cach\u00E9 de configuraci\u00F3n el objeto contenido en la ruta [{0}].
CONFCACHE008 = 
CONFCACHE009 = 
CONFCACHE010 = Se procede a inicializar los datos de configuraci\u00F3n en la cach\u00E9 de configuraci\u00F3n...
CONFCACHE011 = La cach\u00E9 de configuraci\u00F3n ya se encontraba inicializada.
CONFCACHE012 = La cach\u00E9 de configuraci\u00F3n se ha inicializado correctamente.
CONFCACHE013 = 
CONFCACHE014 = 
CONFCACHE015 = 
CONFCACHE016 = 
CONFCACHE017 = 
CONFCACHE018 = 
CONFCACHE019 = 
CONFCACHE020 = 
CONFCACHE021 = 
CONFCACHE022 = 
CONFCACHE023 = 
CONFCACHE024 = 
CONFCACHE025 = 
CONFCACHE026 = 
CONFCACHE027 = 
CONFCACHE028 = 
CONFCACHE029 = 
CONFCACHE030 = 
CONFCACHE031 = Se produjo un error consultando/estableciendo la bandera que indica si la cach\u00E9 de configuraci\u00F3n ha sido inicializada.
CONFCACHE032 = 
CONFCACHE033 = 
CONFCACHE034 = Se ha eliminado correctamente de la cach\u00E9 el nodo contenido en la ruta [{0}].
CONFCACHE035 = 
CONFCACHE036 = Se ha producido un error al tratar de obtener la propiedad que determina el tiempo de espera antes de detener la cach\u00E9 local de configuraci\u00F3n que ha dejado de ser usada. Por defecto se toma un tiempo de 30 segundos.
CONFCACHE037 = 
CONFCACHE038 = Recarga Cach\u00E9 Local: Se inicia una nueva cach\u00E9 local.
CONFCACHE039 = Recarga Cach\u00E9 Local: Se procede a detener la anterior cach\u00E9. Para evitar conflictos, se le otorga un tiempo de vida de [{0} milisegundos].
CONFCACHE040 = 
CONFCACHE041 = 
CONFCACHE042 = 
CONFCACHE043 = 
CONFCACHE044 = 
CONFCACHE045 = 
CONFCACHE046 = 
CONFCACHE047 = 
CONFCACHE048 = 
CONFCACHE049 = 
CONFCACHE050 = Cargando los almacenes de certificados en la cach\u00E9 de configuraci\u00F3n...
CONFCACHE051 = Se produjo un error cargando los almacenes de certificados en la cach\u00E9 de configuraci\u00F3n.
CONFCACHE052 = El tiempo empleado en la operativa de cargar los almacenes de certificados en la cach\u00E9 de configuraci\u00F3n ha sido de [{0} milisegundos].

#Textos de la gesti\u00F3n de la cach\u00E9 compartida de la configuraci\u00F3n de la plataforma: TSL.
CONFTSLCACHE000 = 
CONFTSLCACHE001 = 
CONFTSLCACHE002 = 
CONFTSLCACHE003 = 
CONFTSLCACHE004 = 
CONFTSLCACHE005 = 
CONFTSLCACHE006 = 
CONFTSLCACHE007 = 
CONFTSLCACHE008 = 
CONFTSLCACHE009 = 
CONFTSLCACHE010 = 
CONFTSLCACHE011 = 
CONFTSLCACHE012 = 
CONFTSLCACHE013 = 
CONFTSLCACHE014 = 
CONFTSLCACHE015 = 
CONFTSLCACHE016 = 
CONFTSLCACHE017 = 
CONFTSLCACHE018 = 
CONFTSLCACHE019 = 
CONFTSLCACHE020 = 
CONFTSLCACHE021 = 
CONFTSLCACHE022 = 
CONFTSLCACHE023 = 
CONFTSLCACHE024 = 
CONFTSLCACHE025 = 
CONFTSLCACHE026 = 
CONFTSLCACHE027 = 
CONFTSLCACHE028 = 
CONFTSLCACHE029 = 
CONFTSLCACHE030 = 
CONFTSLCACHE031 = 
CONFTSLCACHE032 = 
CONFTSLCACHE033 = 
CONFTSLCACHE034 = 
CONFTSLCACHE035 = 
CONFTSLCACHE036 = 
CONFTSLCACHE037 = 
CONFTSLCACHE038 = 
CONFTSLCACHE039 = 
CONFTSLCACHE040 = 
CONFTSLCACHE041 = 
CONFTSLCACHE042 = 
CONFTSLCACHE043 = 
CONFTSLCACHE044 = 
CONFTSLCACHE045 = 
CONFTSLCACHE046 = 
CONFTSLCACHE047 = 
CONFTSLCACHE048 = 
CONFTSLCACHE049 = 
CONFTSLCACHE050 = 
CONFTSLCACHE051 = 
CONFTSLCACHE052 = 
CONFTSLCACHE053 = 
CONFTSLCACHE054 = 
CONFTSLCACHE055 = 
CONFTSLCACHE056 = 
CONFTSLCACHE057 = 
CONFTSLCACHE058 = 
CONFTSLCACHE059 = 
CONFTSLCACHE060 = 
CONFTSLCACHE061 = 
CONFTSLCACHE062 = 
CONFTSLCACHE063 = 
CONFTSLCACHE064 = Para poder almacenar la relaci\u00F3n entre URL de localizaci\u00F3n de la TSL y su ID en la cach\u00E9 de configuraci\u00F3n de TSL, esta no puede ser nula.
CONFTSLCACHE065 = Para poder eliminar la relaci\u00F3n entre URL de localizaci\u00F3n de la TSL y su ID de de la cach\u00E9 de configuraci\u00F3n de TSL, esta no puede ser nula.
CONFTSLCACHE066 = Para obtener los datos de la \u00FAltima TSL asociada a una localizaci\u00F3n concreta, dicha localizaci\u00F3n no puede ser nula.
CONFTSLCACHE067 = 
CONFTSLCACHE068 = 
CONFTSLCACHE069 = 
CONFTSLCACHE070 = 
CONFTSLCACHE071 = 
CONFTSLCACHE072 = 
CONFTSLCACHE073 = 
CONFTSLCACHE074 = 
CONFTSLCACHE075 = 
CONFTSLCACHE076 = 
CONFTSLCACHE077 = 
CONFTSLCACHE078 = 
CONFTSLCACHE079 = 
CONFTSLCACHE070 = TSL:
CONFTSLCACHE081 = 
CONFTSLCACHE082 = 
CONFTSLCACHE083 = 
CONFTSLCACHE084 = 
CONFTSLCACHE085 = 
CONFTSLCACHE086 = 
CONFTSLCACHE087 = 
CONFTSLCACHE088 = 
CONFTSLCACHE089 = 
CONFTSLCACHE090 = No se puede inicializar una instancia de mapeo de TSL para un pa\u00EDs/regi\u00F3n en la cach\u00E9 de configuraci\u00F3n a partir de un objeto nulo.
CONFTSLCACHE091 = No se puede inicializar una instancia de TSL para un pa\u00EDs/regi\u00F3n en la cach\u00E9 de configuraci\u00F3n a partir de un objeto y/o representaci\u00F3n nulos.
CONFTSLCACHE092 = No se puede inicializar una instancia de pa\u00EDs/regi\u00F3n en la cach\u00E9 de configuraci\u00F3n a partir de un objeto nulo.
CONFTSLCACHE093 = El objeto a insertar en la cach\u00E9 de configuraci\u00F3n de TSL no cumple las condiciones para actualizar el ya existente.
CONFTSLCACHE094 = El objeto que representa al pa\u00EDs/regi\u00F3n de la TSL que se quiere insertar en la cach\u00E9 de configuraci\u00F3n de TSL no puede ser nulo.
CONFTSLCACHE095 = El objeto que representa la TSL que se quiere insertar en la cach\u00E9 de configuraci\u00F3n de TSL no puede ser nulo.
 
# Textos de la gesti\u00F3n de la cach\u00E9 de configuraci\u00F3n de keystores
CONFKEYSTORECACHE000 = El Keystore a almacenar en la cach\u00E9 de configuraci\u00F3n no puede ser nulo.
CONFKEYSTORECACHE001 = No se ha a\u00F1adido el keystore [{0}] con identificador [{1}] y versi\u00F3n [{2}] en la cach\u00E9 compartida debido a que ya exist\u00EDa este mismo con versi\u00F3n [{3}].
CONFKEYSTORECACHE002 = Se produjo un error durante la creaci\u00F3n del objeto que representa a un keystore en la cach\u00E9 de configuraci\u00F3n.
CONFKEYSTORECACHE003 = Almac\u00E9n de certificados:
CONFKEYSTORECACHE004 = Serializando el almac\u00E9n de certificados...
CONFKEYSTORECACHE005 = Almac\u00E9n de certificados serializado correctamente.
CONFKEYSTORECACHE006 = Deserializando un almac\u00E9n de certificados...
CONFKEYSTORECACHE007 = No se han obtenido keystores de base de datos para cargarlos en la cach\u00E9 de configuraci\u00F3n.

#Textos de la gesti\u00F3n de la cach\u00E9 de configuraci\u00F3n de aplicaciones
CONFAPPLICATIONCACHE000 = No se puede inicializar una instancia de aplicaci\u00F3n en la cach\u00E9 compartida a partir de un objeto nulo.
CONFAPPLICATIONCACHE001 = Se produjo un error durante la creaci\u00F3n del objeto que representa una aplicaci\u00F3n en la cach\u00E9 de configuraci\u00F3n.
CONFAPPLICATIONCACHE002 = Aplicaci\u00F3n:
CONFAPPLICATIONCACHE003 = No se ha actualizado la aplicaci\u00F3n con identificador [{0}] en la cach\u00E9 compartida al no cumplir las condiciones requeridas.
CONFAPPLICATIONCACHE004 = La aplicaci\u00F3n a a\u00F1adir en la cach\u00E9 es nula.
CONFAPPLICATIONCACHE005 = No se puede actualizar en la cach\u00E9 una aplicaci\u00F3n si el POJO que lo representa es nulo (o sin identificador).
